Revit 2024 API
ParameterTypeId.DimLeaderType Property
 "Leader Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DimLeaderType { get; }
Visual Basic
Public Shared ReadOnly Property DimLeaderType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DimLeaderType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace